// Тема ЦОК отображается во многих элементах
const themeOfDEC = 'Забойные двигатели'
// Номер ФГОС и Тескт ФГОС
const numFgos = '21.02.02 '
const numFgosTxt = 'Бурение нефтяных и газовых скважин'
// Номер МДК и Текст МДК
const numMDK = '01.01. '
const numMDKTxt = 'Технология выполнения работ по бурению, креплению, испытанию и освоению нефтяных и газовых скважин'
const razdel = 'Технология бурения нефтяных и газовых скважин'
// Массив с рекомендациями
const textOfMethodMaterials = [
    `<p class='pink_subtitle'>Рекомендации для обучающегося</p>
    Просмотрите динамическую инфографику по теме «Забойные двигатели».
    Если в процессе изучения материала возникнут вопросы, запишите их для дальнейшего обсуждения с преподавателем и/или с группой обучающихся.
    Обратите внимание на основные вопросы лекции: <br>- Назначение, виды и устройство забойных двигателей; <br>- Выбор способа бурения; <br>- Эксплуатация забойных двигателей; <br>- Транспортирование и хранение забойных двигателей; <br>- Технические и энергетические характеристики забойных двигателей.
    При необходимости просмотрите материал еще раз.
    Возвращайтесь к наиболее сложным аспектам темы.
    Соблюдайте здоровьесберегающий режим: чередуйте работу с электронными носителями с отдыхом и гимнастикой для глаз.
    <p class='pink_subtitle'>Рекомендации для преподавателя</p>
    Применение данного ЭОМ  в ходе занятия поможет преподавателю мотивировать обучающихся к усвоению нового материала через визуализацию теоретического материала с помощью различных видов графики и видео и его изложение доступным языком, а так же через возможность организации интерактивной деятельности.
    Преподаватель может организовать изучение обучающимися образовательных материалов ЭОМ через применение различных педагогических технологий, например:<br>- организовать изучение теоретических материалов  ЭОМ  до начала учебного занятия, а во время учебного занятия провести беседу, отвечая на вопросы обучающихся, уточняя и расширяя первичные знания;<br>- организовать изучение нового материала с применением материалов ЭОМ непосредственно на занятии, через демонстрацию материалов ЭОМ, в т.ч. иллюстраций (схем, графиков, фото, видео и пр.);<br>- организовать работу обучающихся в группах непосредственно на занятии с использованием учебных материалов ЭОМ;<br>- предложить повторное изучение материалов ЭОМ после проведения учебных занятий с целью закрепления материала и подготовки к промежуточной аттестации и пр.
    В ходе занятия преподавателю предлагается, опираясь на материалы данного ЭОМ раскрыть следующие вопросы:<br>- Назначение, виды и устройство забойных двигателей;<br>- Выбор способа бурения;<br>- Эксплуатация забойных двигателей;<br>- Транспортирование и хранение забойных двигателей;<br>- Технические и энергетические характеристики забойных двигателей.`,
    `<p class='pink_subtitle'>Рекомендации для обучающегося</p>
    Запустите виртуальный тренажер по теме «Забойные двигатели».
    Ознакомьтесь с предложенными материалами и выполните тренировочные тестовые задания.
    Обратите внимание, что на выполнение всех тестовых заданий предусмотрено 2 попытки.
    Если в процессе изучения материала возникнут вопросы, запишите их для дальнейшего обсуждения с преподавателем и/или с группой обучающихся.
    При неверном ответе на тестовое задание, вернитесь к предыдущему материалу и изучите его повторно.
    Тренировочные тестовые задания предусматривают отображение правильных вариантов ответов после их выполнения.
    Запустить виртуальный тренажер можно неограниченное количество раз.
     <p class='pink_subtitle'>Рекомендации для преподавателя</p>
     Преподаватель может организовать изучение обучающимися образовательных материалов ЭОМ через применение различных педагогических технологий, например: <br>- организовать изучение практических материалов  ЭОМ  до начала учебного занятия, а во время учебного занятия организовать проведение практической работы на основе материалов ЭОМ; <br>- организовать изучение материалов ЭОМ непосредственно на занятии, выявить наиболее часто встречающие ошибки при выполнении проверочных тестовых заданий, организовать работу над ошибками; <br>- предложить повторное изучение материалов ЭОМ после проведения учебных занятий с целью закрепления материала и подготовки к промежуточной аттестации и пр. <br>Применение данного ЭОМ на занятии поможет активизировать познавательную деятельность обучающихся, способствует развитию  логического мышления, памяти, внимательности, наблюдательности.`,
    `<p class='pink_subtitle'>Рекомендации для обучающегося</p> 
    Запустите интерактивную мини-игру по теме «Забойные двигатели».
    Ознакомьтесь с условиями выполнения тестовых заданий. Обратите внимание на отсутствие подсказок и возможности повторного выполнения заданий.
    Выполните все тестовые задания. Ознакомьтесь с результатами тестирования.
    При наличии ошибок по результатам тестирования вернитесь к изучению теоретического материала.
    Запустить интерактивную мини-игру возможно неограниченное количество раз.
    <p class='pink_subtitle'>Рекомендации для преподавателя</p>
    Применяя данный ЭОМ преподаватель может мотивировать обучающихся для получения максимального количества баллов при выполнении тестовых заданий, предложенных с целью диагностики приобретенных знаний, умений и навыков, учитывая результаты тестирования при выставлении оценки по теме.
    Преподаватель может анализировать результаты тестирования обучающихся с целью выявления наиболее сложных для понимания вопросов темы, с целью последующей организации работы по устранению данных пробелов в знаниях обучающихся. `
];
// Ключевые слова
const keyWords = `Бурение \n процесс сооружения скважины путем разрушения горных пород.
Ствол скважины \n пространство, ограниченное стенкой скважины.
Устье \n верхняя часть скважины.
Турбобур \n это гидравлический забойный двигатель, в котором энергия потока промывочной жидкости преобразуется в механическую энергию вращения вала.
Турбина \n рабочий орган турбобура.
Статор \n направляющий аппарат турбины, является неподвижной деталью корпуса турбобура.
Ротор \n рабочее колесо турбины, является вращающейся деталью, закрепленной на валу турбобура.
Энергетическая характеристика турбобура \n совокупность зависимостей крутящего момента, перепада давления, мощности, коэффициента полезного действия от частоты вращения вала при заданных значениях расхода и плотности бурового раствора.
Электробур \n асинхронный маслонаполненный двигатель и маслонаполненный шпиндель на подшипниках качения, размещенные в трубном корпусе.
Винтовой забойный двигатель \n разновидность забойной гидравлической машины, в которой для преобразования энергии потока промывочной жидкости в механическую энергию вращательного движения использован винтовой механизм. `
/* 1) ФГОС СПО
2) ПООП Профессионалитета
3) Профессиональный модуль
4) МДК
5) Раздел
6) Тема*/
const infoContent = 
`${numFgos} ${numFgosTxt}
${numFgos} ${numFgosTxt}
ПМ.01 Проведение работ по эксплуатационному и разведочному бурению
${numMDK} ${numMDKTxt}
${razdel}
${themeOfDEC}`
const blockButtonEOM2 = 1; // "Это для разработки и отладки удобно, блокирует кнопки назад и далее в ЭОМ_2 1 true 0 false"
const typeOfEOM3 = 0; // Если 1 то это тест если что то иное то мини-игра
const typeOfEOM1 = 0; // Если 1 то это video если что то иное то dynamic_info